Appiko/nrf5x-firmware/application/sense_pir/sensepi_cam_trigger.c
void out_gen_config_updater_timer(void)
{
    uint32_t config_mode = config.config_sensepi->timer_conf.mode;
    uint32_t mode = ((config_mode & MODE_MSK) 
            >> (MODE_POS * SIZE_OF_BYTE));
    uint32_t input1 = ((config_mode & INPUT1_MSK) 
            >> (INPUT1_POS * SIZE_OF_BYTE));
    uint32_t input2 = ((config_mode & INPUT2_MSK) 
            >> (INPUT2_POS * SIZE_OF_BYTE));
    uint32_t single_input = config_mode>> (INPUT1_POS * SIZE_OF_BYTE);
    switch((operational_mode_t)mode)
    {
        case MODE_SINGLE_SHOT:
        {
            out_gen_config_single_shot(TIMER_IDLE);
            break;
        }
        case MODE_MULTISHOT:
        {
            out_gen_config_multi_shot(TIMER_IDLE, input1, input2);
            break;
        }
        case MODE_BULB :
        {
            //Using both input 1 and input 2
            out_gen_config_bulb_expo(TIMER_IDLE, single_input);
            break;
        }
        case MODE_VIDEO :
        {
            out_gen_config_full_video(TIMER_IDLE,input1);
            break;
        }
        case MODE_FOCUS :
        {
            out_gen_config_focus_only(TIMER_IDLE);
            break;
        }
        case MODE_NONE:
        {
            out_gen_config_none(PIR_IDLE);
        }
    }   
}

void out_gen_done_handler (uint32_t out_gen_state)
{
    log_printf("%s",__func__);
    log_printf(" %d\n", out_gen_state);
    switch((cam_trig_state_t)out_gen_state)
    {
        case PIR_IDLE :
        {
            pir_set_state(pir_on_flag);
            break;
        }
        case TIMER_IDLE : 
        {
            if(config.config_sensepi->trig_conf == PIR_AND_TIMER)
            {
                pir_set_state(pir_on_flag);
            }
            break;
        }
        case VIDEO_IDLE :
        {
            out_gen_start(&out_gen_config[VIDEO_IDLE]);
            pir_set_state(pir_on_flag);
            break;
        }
        case MAX_STATES : 
        {
            log_printf("Something went seriously wrong..!!\n");
            break;
        }
    }
}

void light_sense_init(void)
{
    log_printf("%s\n",__func__);
    led_sense_init (config.led_sense_out_pin,
                    config.led_sense_analog_in_pin,
                    config.led_sense_off_val);
}

void light_sense_set_state(bool state)
{
    if(state == true)
    {
        led_sense_cfg_input(true);
        //To make sure that the green LED is ready to sense light
        hal_nop_delay_ms(LED_WAIT_TIME_MS);
    }
    else
    {
        led_sense_cfg_input(false);
    }
}

bool light_sense_light_check(oper_time_t oper_time)
{
    log_printf("%d\n", __func__);

    uint8_t light_sense_config = oper_time.day_or_night;
    uint32_t light_threshold =
            (uint32_t)((oper_time.threshold) * LIGHT_THRESHOLD_MULTIPLY_FACTOR);

    uint32_t light_intensity = led_sense_get();
    log_printf("Light Intensity : %d\n", light_intensity);

    static bool light_check_flag = 0;
    //Day and its brighter than the threshold
    if(((light_sense_config == 1) && (light_intensity >= light_threshold))
            ||  //Night and its dimmer than the threshold
       ((light_sense_config == 0) && (light_intensity <= light_threshold)))
    {
        light_check_flag = 1;
    }
    else
    {
        light_check_flag = 0;
    }
    return light_check_flag;
}

void module_manager_start_check(void)
{
    log_printf("%s\n", __func__);
    //Switch off PIR module so that light sensing can happen
    pir_set_state(false);
    bool light_flag;
    switch(config.config_sensepi->trig_conf)
    {
        case PIR_ONLY : 
        {
            light_flag = light_sense_light_check(config.config_sensepi->pir_conf.oper_time);
            pir_on_flag = light_flag;
            pir_set_state(light_flag);
            
            break;
        }
        case TIMER_ONLY : 
        {
            light_flag = light_sense_light_check(config.config_sensepi->timer_conf.oper_time);
            timer_set_state(light_flag);
                    
            break;
        }
        case PIR_AND_TIMER :
        {
            light_flag = light_sense_light_check(config.config_sensepi->pir_conf.oper_time);
            pir_on_flag = light_flag;
            pir_set_state(light_flag);

            light_flag = light_sense_light_check(config.config_sensepi->timer_conf.oper_time);
            timer_set_state(light_flag);

            break;
        }
    }

}

void module_manager_disable_all(void)
{
    pir_set_state(false);
    timer_set_state(false);
    light_sense_set_state(false);
}

void out_gen_config_single_shot(cam_trig_state_t data_process_mode)
{
    log_printf("%s\n", __func__);
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS;
    int32_t time_remain;

    if(data_process_mode == PIR_IDLE)
    {
        time_remain = MS_TIMER_TICKS_MS(config.config_sensepi->pir_conf.intr_trig_timer * 100) 
            - (SINGLE_SHOT_DURATION); 
        if((int32_t)time_remain <= 0)
        {
            time_remain = 0;
        }
    }
    else if(data_process_mode == TIMER_IDLE)
    {
        time_remain = 0;
    }

    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,
        .transitions_durations = { SINGLE_SHOT_DURATION, time_remain },
        .next_out = {{0, 1, 1},
                     {0, 1, 1}},
    };

    debug_print_bool_array(local_out_gen_config.next_out, "single shot");
    memcpy(&out_gen_config[data_process_mode],&local_out_gen_config,
           sizeof(out_gen_config_t));
}

void out_gen_config_multi_shot(cam_trig_state_t data_process_mode, 
                     uint32_t burst_duration, uint32_t burst_num)
{
    log_printf("%s\n", __func__);
    int32_t time_remain;
    uint32_t number_of_transition = SINGLE_SHOT_TRANSITIONS * burst_num;
    //Time for trigger pulse and time till next trigger for each burst
    uint32_t repeat_delay_array[SINGLE_SHOT_TRANSITIONS] = {SINGLE_SHOT_DURATION,
            MS_TIMER_TICKS_MS(burst_duration * 100) - SINGLE_SHOT_DURATION};
    out_gen_config_t local_out_gen_config = 
    {
        .num_transitions = number_of_transition,
        .done_handler = out_gen_done_handler,
        .out_gen_state = data_process_mode,
    };

